load-tests/results/high-traffic-p95fix-tier1-logbuffer-500x500/k6-console.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /work/load-tests/k6/high-traffic-500vu-10000.js
        output: -

     scenarios: (100.00%) 1 scenario, 500 max VUs, 10m30s max duration (incl. graceful stop):
              * high_traffic_booking: 500 iterations shared among 500 VUs (maxDuration: 10m0s, gracefulStop: 30s)


Run                    [ 100% ] setup()
high_traffic_booking   [   0% ]

Run                    [ 100% ] setup()
high_traffic_booking   [   0% ]

running (00m02.8s), 000/500 VUs, 500 complete and 0 interrupted iterations
high_traffic_booking ✓ [ 100% ] 500 VUs  00m00.7s/10m0s  500/500 shared iters


  █ TOTAL RESULTS 

    checks_total.......: 1000    358.60708/s
    checks_succeeded...: 100.00% 1000 out of 1000
    checks_failed......: 0.00%   0 out of 1000

    ✓ reservation response has an id
    ✓ reservation response is pending

    CUSTOM
    cancellations_succeeded............: 0      0/s
    errors_idempotency_in_progress.....: 0      0/s
    errors_rate_limited................: 0      0/s
    errors_sold_out....................: 0      0/s
    errors_user_limit..................: 0      0/s
    reservation_server_faults..........: 0      0/s
    reservation_unexpected_responses...: 0      0/s
    reservations_accepted..............: 500    179.30354/s
    reservations_created...............: 500    179.30354/s
    reservations_replayed..............: 0      0/s
    reserve_latency....................: avg=378.84ms min=88.34ms  med=400.79ms p(90)=451.45ms p(95)=485.95ms p(99)=500.55ms max=530.54ms

    HTTP
    http_req_duration..................: avg=380.75ms min=88.34ms  med=401.77ms p(90)=454.49ms p(95)=486.53ms p(99)=502.46ms max=1.07s   
      { expected_response:true }.......: avg=380.75ms min=88.34ms  med=401.77ms p(90)=454.49ms p(95)=486.53ms p(99)=502.46ms max=1.07s   
    http_req_failed....................: 0.00%  0 out of 503
    http_reqs..........................: 503    180.379361/s

    EXECUTION
    iteration_duration.................: avg=421.21ms min=138.71ms med=430.74ms p(90)=500.07ms p(95)=519.01ms p(99)=560.87ms max=600.19ms
    iterations.........................: 500    179.30354/s
    vus................................: 0      min=0        max=0  
    vus_max............................: 500    min=500      max=500

    NETWORK
    data_received......................: 386 kB 139 kB/s
    data_sent..........................: 295 kB 106 kB/s



running (00m02.8s), 000/500 VUs, 500 complete and 0 interrupted iterations
high_traffic_booking ✓ [ 100% ] 500 VUs  00m00.7s/10m0s  500/500 shared iters